app/controllers/stateswar_controller.rb

  def index
    @num_solders = [1, 2, 5, 10, 20]
    @my_states = State.myStates(session[:alliance])  if session[:alliance]
    #@states = State.find(:all, :conditions => { :user_id >= 0 })
    #@states = State.getStates
    @states = State.find(:all)
---
SELECT state_name FROM `states` WHERE (alliance=2)

  def refresh_profile_info
    @user = User.find_by_id(session[:user_id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 5) LIMIT 1

  def train_soldiers
    logger.info "request soldiers #{params[:soldiers]}, current turns #{session[:turns]}"
    @user = User.find_by_id(session[:user_id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 19) LIMIT 1

  def add_soldier
    # remove num of soldier from the user
    # add a soldier to the state
    num_soldiers = params[:soldiers].to_i
    logger.info "** DEBUG ADD SOLDIER #{params[:state_name]}, USER #{session[:user_name]}"
    if params[:state_name].length == 2
      @user = User.find_by_id(session[:user_id])
      @state = State.find_by_state_name(params[:state_name])
      if @user.total_soldiers > num_soldiers and @state
        @user.total_soldiers -= num_soldiers
        @state.soldiers += num_soldiers
        @user.save
---
SELECT * FROM `users` WHERE (`users`.`id` = 20) LIMIT 1
SELECT * FROM `states` WHERE (`states`.`state_name` = 'WY') LIMIT 1
UPDATE `states` SET `soldiers` = 2, `updated_at` = '2009-02-13 22:46:28' WHERE `id` = 1
UPDATE `users` SET `total_soldiers` = 50, `updated_at` = '2009-02-13 22:46:28' WHERE `id` = 20

  def sell_soldier
    num_soldiers = params[:soldiers].to_i
    obtained_turns = num_soldiers * (GameRules::TURNS_PER_SOLDIER / 2)
    logger.info "** DEBUG SELL SOLDIER #{num_soldiers}, USER #{session[:user_name]}"

    flash[:notice] = "SELL SOLDIER #{num_soldiers}, GOT TURNS #{obtained_turns}"
    @user = User.find_by_id(session[:user_id])
    if @user.total_soldiers > num_soldiers
      @user.total_soldiers -= num_soldiers
      @user.turns += obtained_turns
      @user.save
---
SELECT * FROM `users` WHERE (`users`.`id` = 19) LIMIT 1
UPDATE `users` SET `total_soldiers` = 36, `updated_at` = '2009-02-13 22:55:11', `turns` = 86 WHERE `id` = 19

  def attack_region
    initial_soldier_num = 1
    logger.info "** DEBUG: ATTACK #{params[:state_name]}, attack soldiers #{params[:soldiers]}"
    num_soldiers = params[:soldiers].to_i
    if params[:state_name].length == 2
      @user = User.find_by_id(session[:user_id])
      @state = State.find_by_state_name(params[:state_name])
      if @user.total_soldiers > num_soldiers and @user.turns > GameRules::TURNS_CONSUMED_PER_ATTACK and @state
        @user.total_soldiers -= num_soldiers
        @user.total_soldiers -= initial_soldier_num
        @user.turns -= GameRules::TURNS_CONSUMED_PER_ATTACK
        @user.save
---
SELECT * FROM `users` WHERE (`users`.`id` = 20) LIMIT 1
SELECT * FROM `states` WHERE (`states`.`state_name` = 'MI') LIMIT 1
UPDATE `states` SET `alliance` = 2, `soldiers` = 1, `user_id` = 5, `updated_at` = '2009-02-13 23:36:26' WHERE `id` = 9
UPDATE `users` SET `total_soldiers` = 41, `updated_at` = '2009-02-13 23:10:53', `turns` = 30 WHERE `id` = 20

  def expand_region
    logger.info "** DEBUG: expand #{params[:state_name]}, user #{session[:user_name]}"
    initial_soldier_num = 1

    #state_name = params[:state_name]
    if params[:state_name].length == 2
      @user = User.find_by_id(session[:user_id])
      @state = State.find_by_state_name(params[:state_name])
      if @state == nil
        @state = State.new()
        #update
        @state.state_name = params[:state_name]
        @state.user_id = @user.id
        @state.alliance = @user.alliance
        @state.soldiers = initial_soldier_num
        @state.created_at = Time.now
---
SELECT * FROM `users` WHERE (`users`.`id` = 20) LIMIT 1
SELECT * FROM `states` WHERE (`states`.`state_name` = 'WY') LIMIT 1
INSERT INTO `states` (`alliance`, `updated_at`, `state_name`, `soldiers`, `user_id`, `created_at`) VALUES(0, '2009-02-13 22:37:32', 'WY', 0, 20, '2009-02-13 22:37:32')