app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` IS NULL) LIMIT 1
---
    def index
        @user = User.find_by_id(session[:user_id])

UPDATE `users` SET `last_time_login` = '2009-02-13 10:53:42', `last_time_turns_commit` = '2009-02-13 10:52:23', `total_soldiers` = 52, `updated_at` = '2009-02-13 10:53:42', `turns` = 51 WHERE `id` = 4
---
    def login
        user = User.authenticate( params[:name], params[:password] )
        if user
            oldTurns = user.turns
            user.update_turns_by_time()

INSERT INTO `users` (`name`, `salt`, `turns`, `score`, `last_time_login`, `viewport_y`, `alliance`, `total_zones`, `updated_at`, `hashed_password`, `last_time_turns_commit`, `public_info`, `total_soldiers`, `viewport_x`, `email`, `created_at`) VALUES('blue', '385517400.536413778033079', 50, NULL, '2009-02-13 19:41:06', 0.0, 2, 0, '2009-02-13 19:41:06', '2cbba59557ba2cc1b9a6b2b82d958aa4e2999fc6', NULL, NULL, 50, 0.0, NULL, '2009-02-13 19:41:06')
---
    def new
        if request.post?
            redirect_to( :action => "new" ) if not params[:user]

            @user         = User.new( params[:user] )
            @user.total_soldiers= GameRules::DEFAULT_STARTING_SOLDIER
            @user.total_zones=0
            @user.turns      = GameRules::DEFAULT_STARTING_TURNS

            @user.alliance = UsersHelper.getAllianceId(params[:alliance]) # StatesGame

            #view port starts from (0,0)
            @user.viewport_x     = 0
            @user.viewport_y     = 0
            @user.last_time_login = Time.now
            @user.last_time_turns_commit = Time.now

            #more operations on the default values

            if @user.save

SELECT * FROM `users` WHERE (`users`.`id` = 4) LIMIT 1
---
    def info
        @user = User.find_by_id(session[:user_id])