app/controllers/zones_controller.rb

SELECT * FROM `zones` WHERE (x >= '0' AND x <= '39' AND y >= '0' AND y <= '29' AND user_id = '4')
SELECT * FROM `users` WHERE (`users`.`id` = 4) LIMIT 1
---
  def index
    #the displaying range of the world
    if (!params[:x1])
      @x_min = 0
    else
      @x_min = params[:x1].to_i
    end

    if (!params[:x2])
      @x_max = 39
    else
      @x_max = params[:x2].to_i
    end

    if (!params[:y1])
      @y_min = 0
    else
      @y_min = params[:y1].to_i
    end

    if (!params[:y2])
      @y_max = 29
    else
      @y_max = params[:y2].to_i
    end

    @zones = Zone.find_zones_in_view(@x_min, @x_max, @y_min, @y_max)
    @user = User.find_by_id(session[:user_id])